[{"Job Title": "Data Scientist / Predictive Modeler", "Company Name": "M Theory Solutions", "Location": "Palo Alto, CA 94304", "Url": "https://www.indeed.com/cmp/M-Theory-Solutions/jobs/Data-Scientist-b3cb31d46f7f5371?sjdu=QwrRXKrqZ3CNX5W-O9jEveJgZ7DRbh_ySwPONsqRa9a6SAiu8IrRm2Dp_pAb_T7opEvxJeYF9tRETzxACXeIXAtoNSPSVuB9ukF45h2qiVg&vjs=3", "Job Description": "Job SummaryOpportunity BackgroundReady to demonstrate your marketing analytics and data sciences prowess? Two great opportunities to stretch your skills and experience to their fullest potential. One is for a full-time contract position and the other is a contract-to-hire role. Both positions are for a top brand, fortune 500 company in Silicon Valley. You’ll have access to large B2B and B2C data sets on a robust analytic platform. Customer and account data is enriched with demographics and firmagraphics, transactional purchase history, Web behavior and cross-channel marketing campaign history. Tools and analytic environment include SAS, Tableau, and well-managed MPP RDBMS, Hadoop & Hive. This position has a reasonable work-load, providing a decent work-life balance and won’t burn you to a crisp like other Valley gigs.Skills & ExperienceYou should have 3-5 years background in developing predictive modeling algorithms using Python/R, along with other tools in the Apache Big Data stack. You should be well-versed in machine learning algorithms – which is best for achieving business/analytic objectives: Bayesian, Regression, Decision Tree, Clustering & Neural Networks. You should be familiar with common marketing models: cross-sell, campaign response, churn, lifetime value. Finally, you’ll need to have experience in deploying these models into a marketing environment.Education & Eligibility: Bachelor of Science in Computer Science, Statistics or relevant degreeMS Degree preferredMust be eligible to work in the U.S.Must be able to work onsite at least 80%Compensation & Benefits: Competitive hourly rate or salary provided based on experienceThe full-time role will have full benefits package (healthcare, 401k, 10 days PTO)Contract position also gets 1.2 PTO days per monthJob Type: ContractSalary: $12,000.00 to $15,000.00 /monthExperience:Predictive Modeling: 3 yearsEducation:Master'sLocation:Palo Alto, CA 94304Required work authorization:United States"}, {"Job Title": "Data Scientist", "Company Name": "Indeed", "Location": "San Francisco, CA", "Url": "https://www.indeed.com/viewjob?jk=5ee107718f2d2c0f&q=data+scientist&l=San+Francisco,+CA&from=web&advn=9767451333976163&sjdu=QwrRXKrqZ3CNX5W-O9jEvQIRfhRcze5dUvqrRHhxhD2mqCmHjX-lrUOOJlBAVcJ9brBVOyjcpjXK446TckgF3rvXly7uWh3SNICSXVgTL2MyO_iOv1HCPS3kC-E5gVSg&acatk=1cenkmuri1flo3sc&pub=4a1b367933fd867b19b072952f68dceb&vjs=3", "Job Description": "Our mission:\nAs the world’s number 1 job site, our mission is to help people get jobs. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for job seekers.\n\nThe team:\nWe are a rapidly growing and highly capable engineering team building the most popular job site on the planet. Every month, over 200 million people count on us to help them find jobs, publish their resumes, process their job applications, and connect them to qualified candidates for their job openings. With engineering hubs in Seattle, San Francisco, Austin, Tokyo and Hyderabad, we are improving people's lives all around the world, one job at a time.\n\nYour job:\nAs a Data Scientist at Indeed your role is to follow the data. Analyze, visualize, and model job search related data. You will build and implement machine learning models to make timely decisions. You will have access to unparalleled resources within Indeed to grow and develop both personally and professionally.\n\nWe are looking for a mixture between a statistician, scientist, machine learning expert and engineer: someone who has passion for building and improving Internet-scale products informed by data. The ideal candidate understands human behavior and knows what to look for in the data.\n\nAbout you:\nRequirements\n\n\nPh.D. or M.S. in a quantitative field such as Computer Science, Statistics, or Mathematics\nMinimum 2+ years of professional industry experience in data science\nExpertise in machine learning and statistical modeling\nPassion to answer Product/Engineering questions with data\nStrong ability to code in Python\n\nWe get excited about candidates who\n\n\nHave full stack experience in data collection, aggregation, analysis, visualization, productionization, and monitoring of data science products\nAre proficient in small data modeling work: Python, R, Julia, Octave\nAre proficient in big data modeling work: Hadoop, Pig, Scala, Spark\nCan fish for data: SQL, Pandas, MongoDB\nDeploy data science solutions: Java, Python, C++\nCommunicate concisely and persuasively with engineers and product managers\n\nIndeed provides a variety of benefits that help us focus on our mission of helping people get jobs.\n\nView our bounty of perks: [1] http://indeedhi.re/IndeedBenefits"}, {"Job Title": "Data Scientist - Insurance", "Company Name": "Blue Owl", "Location": "San Francisco, CA", "Url": "https://www.indeed.com/viewjob?jk=629d660ec8a6ca11&tk=1cenkn2jc1flo713&from=serp&alid=3&advn=377656857425241", "Job Description": "A million people a year die in car collisions around the world and we want that number to be zero. We invite you to help us build an InsurTech company that uses rich customer insights, advanced technology and data science to save lives by preventing car collisions before they happen. To this end, we recently helped launch our first product, hiroad.com, a cloud native insurance solution that rewards people for the act of driving well.\n\nWith impressive funding, a compelling vision, and a world-class team, we're poised to re-engineer a trillion-dollar category from the ground up- and that's just where we're beginning. Longer term, we're out to change behavior and promote mindful living at a societal level.\n\nWe're seeking someone to build and support critical backend systems and services that are core to our business. This includes the rewards system that will be used to increase driver safety, designing APIs, creating/managing databases, and writing automated test suites.\n\nGeneral tools you build will be open sourced and will ideally be consumed by the greater community.\nJob requirements\nThis role will require the candidate to be extremely hands on with building models and data driven tools. Past experience implementing complex data-driven solutions is required.\nAdvanced Python skills. Should be familiar with Python’s scientific computing ecosystem.\nAdvanced SAS skills. Should be familiar with SAS best practices.\nDeep experience with GLMs as well as modern machine learning methods.\nActuarial science is a plus, but is not required.\nMore details\nSalary: We invest in first-rate people and pay top-of-market salaries for most positions, factoring in experience and talent. We are unable to offer equity.\nBenefits: Full medical, dental, vision coverage, 401k, daily catered lunch, wellness reimbursement & on-site shower, four weeks of vacation, six weeks of parental leave, panoramic views, and more.\nLocation: Near Montgomery Street BART station, San Francisco, California. Locals preferred, but relocation within the US considered for outstanding candidates.\nAll are welcome at Blue Owl. We are an equal opportunity and affirmative action employer who values diversity and inclusion and looks for applicants who understand, embrace and thrive in a multicultural world. We do not discriminate on the basis of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}, {"Job Title": "Machine Learning Engineer", "Company Name": "Computer Data Concepts", "Location": "San Francisco, CA", "Url": "https://www.indeed.com/cmp/Computer-Data-Concepts/jobs/Machine-Learning-Engineer-3c8f6269e310432d?vjs=3", "Job Description": "Title: Machine Learning Engineer*Location: SFO,CADuration : Long Term C2C*Candidate must have TensorFlow, scikit-learn, CNN, RNN LSTMNice to have workflow automation and container, KubernetesCandidate must have strong experience in PythonRequired Skills: Strong background in classical machine learning and machine learning models is a must and preferably with 2-5 years of experienceKnowledge of deep learning, reinforcement learning and natural language processingHands-on experience in TensorFlow, Scikit-Learn, Python/Java, Spark ML and ability to manipulate large-scale structured and unstructured datasets.Experience with GPU computing and deep learning libraries (TensorFlow, Caffe, Theano, etc.) is a plus.Good to haveWorkflow Automation and KubernetesRetail Domain knowledgeEducation: Master's/Bachelor's Degree in computer science, robotics, mathematics, statistics, machine learningJob Type: ContractExperience:Machine Learning: 1 year"}, {"Job Title": "Data Scientist, Metrics & Experimentation", "Company Name": "Twitter", "Location": "San Francisco, CA 94103", "Url": "https://www.indeed.com/viewjob?jk=e16993d648434139&from=serp&vjs=3", "Job Description": "Who We Are: Experimentation is at the heart of Twitter’s product-development cycle (blog post). As the Metrics & Experimentation team, our mission is to drive a culture of causal reasoning throughout the company, improve how we run and analyze experiments and empower product and business decisions by developing new metrics and implementing new methods for causal inference.\n\nWhat You’ll Do:\n\nAs a data scientist on the Metrics & Experimentation team you will:\nSupport internal research and implementation of new methodologies for experimentation and causal-inference approaches.\nPartner closely with product teams and other data scientists to improve the product metrics and user metrics used in experiments.\nDrive efforts to improve the interpretation of experiment results through education and tools.\nCommunicate findings to executives and cross-functional product teams.\nExamples of recent projects conducted by the team:\n\nWe implemented a framework to facilitate longitudinal cohort analysis in experiments to measure the impact of one-time treatments.\nWe developed tools for finding leading indicators of metric movement in experimentation, enabling faster and less expensive product iterations.\nWho You Are:\n\nYou are passionate about insights, not just data and methods. You are a strategic thinker and are able to synthesize technical concepts into actionable recommendations for a diverse audience.\nYou are rigorous and care about data quality and strive to understand surprising results and underlying mechanisms in your analyses.\nYou combine business acumen with detailed data knowledge and statistical expertise to ensure an accurate interpretation of results.\nYou have experience owning complex projects from start to finish.\nYou are excited to learn and apply new data analysis techniques and tools.\nRequirements:\n\nMasters or PhD involving quantitative data analysis or commensurate work experience.\nExperience working with and analyzing large data sets to solve problems and answer questions.\nStrong knowledge of statistics and experimental design.\nExtensive experience using R or Python for analysis, modeling and data visualization.\nFamiliarity with social network analysis is a plus.\nWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer.\nWe do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.\n\nSan Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}, {"Job Title": "Data Scientist (weather exp a strong +)", "Company Name": "kWh Analytics", "Location": "San Francisco, CA 94111", "Url": "https://www.indeed.com/cmp/kWh-Analytics/jobs/Data-Scientist-6c68d02dd68ae44a?vjs=3", "Job Description": "About UskWh Analytics is the market leader in solar risk management. By leveraging the most comprehensive performance database of solar assets in the United States and the strength of the global insurance markets, kWh Analytics’ customers are able to minimize risk and increase equity returns of their solar portfolios. kWh Analytics is backed by private venture capital and the US Department of Energy.Who we are looking forWe are building a first-of-its-kind predictive model that can accurately forecast the energy output of solar power projects, and we need you to lead the development of the model. We need a self starter who has a strong quantitative background, great communication skills, and ideally an expertise in weather. To help you be successful, you will have access to the largest database of historical solar project performance to feed your model.What you can look forward toYou’ll be responsible for comparing alternative modeling methodologies and choosing the best tools for the jobContinuously seeking new ways to validate and improve the accuracy of the modelDelivering well-supported analysis with uncertainty / confidence metrics that we can stand byRequired skillsExcellent Python coding skillsExcellent command of statistics — random variables, statistical tests, confidence intervals, etc.What you likely need to do the job wellFluency with a variety of statistical modeling approaches, and ability to clearly explain the trade-offs and why a certain one is best for a certain problemExperience working with weather and weather models is strongly preferredYou know the difference between testing a hypothesis and just going on a fishing expeditionA track record of spotting relevant trends in noisy data setsDedication to quality, craftsmanship, truth and accuracy in reportingJob Type: Full-timeRequired work authorization:United States"}, {"Job Title": "Data Scientist - Fall Intern", "Company Name": "Yelp", "Location": "San Francisco, CA 94105", "Url": "https://www.indeed.com/viewjob?jk=432849ca68bd1f4f&from=serp&vjs=3", "Job Description": "At Yelp, it’s our mission to connect people with great local businesses. Yelp’s unique dataset contains billions of interactions between users and local business around the globe, from a user reviewing a neighborhood coffee shop to requesting a repair quote with a photo of a leaky faucet.\nThe Data Science team performs analyses, builds models, and designs experiments that directly impact Yelp’s business and users. Our centralized team is the most wide-ranging consumer of data at Yelp, adept at tasks from modeling content growth and user behavior to sharing insights about the health of local economies.\nWe’re looking for interns to work side-by-side with our Data Scientists at Yelp to make sense of these interactions to deliver impactful analyses and products to our users, business partners and the general public.\nWe Are Looking For:\nPursuing a BA/BS, MS, or PhD in Statistics, Math, Physics, Economics, Computer Science or related quantitative discipline.\nFluency with SQL and Python or R for data analysis.\nSolid understanding of statistical inference, experimental design and analysis.\nEnthusiasm for clean code and sharing reproducible results.\nCommunication skills to work with partners on engineering, product and business teams.\nAn eye for great data visualization with Matplotlib, Plotly, ggplot, or Tableau.\nEndless ideas about how to leverage Yelp's unique data set.\nWhat You Will Do:\nDefine key metrics to track Yelp’s performance and inform product decisions.\nAssess and frame questions from partners into actionable deliverables.\nDesign, execute, and analyze complex experiments impacting millions of users.\nDevise and evaluate models for diverse business needs, such as identifying growth opportunities, personalizing user experience, and matching consumers to businesses.\nOwn analyses start-to-finish and communicate key insights to stakeholders.\nShare your technical skills to develop and maintain high-quality, reusable analysis tools.\nInterested in applying?\nSweet! Share with us why you want to work at Yelp and don't forget to mention any side projects, academic papers, and personal websites/blogs."}, {"Job Title": "Data Scientist", "Company Name": "Tapjoy", "Location": "San Francisco, CA 94104", "Url": "https://www.indeed.com/viewjob?jk=42548aed3d6dd174&from=serp&vjs=3", "Job Description": "Tapjoy's Maximum Impact PlatformTM provides mobile engagement and monetization services for leading advertisers and app developers. Advertisers rely on Tapjoy's diverse suite of rewarded InterplayTM ads including video and rich media to impact performance. Developers utilize our technology and mobile expertise to acquire and monetize users. The Tapjoy SDK is currently embedded in over 15,000 mobile apps, reaching 520 million monthly active users. A 2016 comScoreTM study confirmed Tapjoy Interplay® ads deliver an unprecedented 3x lift across all brand metrics. The company works with Fortune 500 brands and the Top 200 grossing app developers. Founded in 2007, Tapjoy is a global organization with more than a dozen offices worldwide and is headquartered in San Francisco.\n\nTapjoy is backed by top-tier investors, including J.P. Morgan Asset Management, Rho Ventures, North Bridge Venture Partners, InterWest Partners and D.E. Shaw Ventures. Headquartered in San Francisco, the company also has offices in New York, Los Angeles, Chicago, Santa Barbara, Boston, London, Beijing, Shanghai, Seoul and Tokyo.\n\nPosition Title: Data Scientist\n\nPosition Description/Responsibilities: Tapjoy is seeking a Data Scientist. Essential duties and responsibilities may include, but are not limited to, the following as additional roles and/or focus will be needed as the company and department continues to grow and evolve:\n\n\nBuild a data/stats-driven ad optimization system, working closely with the product team\nConstantly experiment and improve the relevancy of the recommendation/ad optimization system\nInvent and improve algorithms given a set of business cases and help implement them in production\nWork with the product/engineering team to implement, test and deploy the solution on Hadoop cluster\n\nCore Competencies include:\n\nPassionate about building data science product\nGreat Communicator about complex algorithmic works as easy-to-understand story telling\nSelf-Starter about game-changing algorithms and motivated to test at billions scaled data\n\nRequirements:\n\nB.S./M.S., in Computer Science, Statistics or similar applied technical field\nMust be hands-on statistics-related industry projects\nSolid object-oriented programming skill (Java) and at least one scripting language such as Python/Ruby/Perl\nAbility to work in a fast paced, test-driven collaborative and iterative programming environment\nUnderstand major machine learning algorithms (Random Forest, Logistic Regression, Boosting method, Neural Network)\nStrong understanding of Algorithms, Data Structures and Data Mining\nUnderstanding of RDBMS, SQL and NoSQL alternatives\nExperience with Hadoop/Hbase/Pig or MapReduce/Mahout/Bigtable is a plus\n\nWhile we’re operating at tremendous scale, we still maintain a startup culture at Tapjoy with all of the casual, social, creative teammates you could desire, and encourage an entrepreneurial mindset where we drive innovation, continuous improvement and tremendous pride in our organization.\n\nIf you want to learn about building an amazing team with industry-leading technology, you want to surround yourself with brilliant, passionate entrepreneurial teammates at Tapjoy.\n\nTapjoy is an equal opportunity employer. We believe that diversity and inclusion lead to stronger, more innovative teams and better business results; we want to draw from the broadest talent pool possible and encourage qualified applicants. Tapjoy does not discriminate on the basis of sex, race, ethnicity, color, age, sexual orientation, gender (including identity and expression), disability (mental or physical), religion, national origin, citizenship, marital status, military or veteran status, or any other protected classification protected by applicable law; we will provide reasonable accommodations for qualified individuals with disabilities, and pursuant to applicable fair chance ordinances, we will consider for employment qualified applicants with arrest and conviction records.\n\nFor more information, please visit www.tapjoy.com."}, {"Job Title": "Data Scientist", "Company Name": "Twitter", "Location": "San Francisco, CA 94103", "Url": "https://www.indeed.com/viewjob?jk=58588886262b9e82&from=serp&vjs=3", "Job Description": "Who We Are:\nThe ads marketplace team is responsible for placing each and every ad that Twitter serves. While placing those ads we decide how best to balance user experience, advertiser results, and Twitter revenue. Our team optimizes the ad delivery engine, manages demand/supply, and improves product outcomes by applying data science and machine learning skills. We routinely deliver significant improvements to our revenue, and work in a close sync with our executive staff (including our COO & CFO) due to our direct impact on Twitter’s business.\nWhat You’ll Do:\nWe’re looking for a key individual contributor to drive our advertising products forward. Ads marketplace decides which ads to serve billions of times a day under a sub-second setting. You will ship new features and optimize existing products. You will perform rigorous analysis, understand our advertising products, experiment, make data-driven decisions, optimize for impact, and measure performance funnels.\n\nYour team will empower you with the autonomy to make good product decisions and ship well-designed code. You’ll own significant projects end-to-end. The small teams of talented, passionate people in which you’ll work will include engineers and data scientists from across the revenue engineering organization. The ads marketplace team works on every high-priority ads project at Twitter.\nWho You Are:\n\nYou’re a data scientist with a track record of delivering results. You find satisfaction in shipping changes that deliver measurable impact in the form of immediate revenue. You apply machine learning and data science techniques when applicable, but are just as happy to implement a simple heuristic when you find it’s as effective at driving impact to your product. You’re looking to join a strong, high-performing team.\n\nSample Projects:\nWe build new ways for advertisers to buy ads on Twitter, such as paying up front for guaranteed results\nWe design incrementality studies to measure the lift in brand awareness that our advertising campaigns drive\nWe dive into individual products (e.g. video ads) to improve results for our most critical business priorities\nWe evaluate the impact of ads on new Twitter users, determining how to show them ads in order to maximize their long-term usage of the product\nWe build more intelligent delivery algorithms resulting in better ROI for our advertisers\nWe are responsible for measuring the results of all experiments on Twitter ads\nRequirements:\nExperience building models, engineering features, and using data intelligently to optimize product performance\nExperience performing analysis on raw event data in modern distributed system engineering stacks\nDeep understanding of data platforms in which you’ve previously worked\nAbility to thrive in an unstructured environment, working autonomously on a strong team to find opportunity and deliver business impact\nGood understanding of (one or more of the following): Python or R\nBonus Points:\nPast experience in adtech\nPhD or MS in computer science, machine learning, or statistics\nExperience in production stacks involving machine learning, AB testing, or control systems\nGood understanding of (one or more of the following): Java, Scala, or C++\nInteresting side projects or Kaggle competition results\nEntrepreneurial mindset\n\nWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.\n\nSan Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}, {"Job Title": "Data Scientist - Pricing & Promotions", "Company Name": "BICP", "Location": "San Francisco, CA", "Url": "https://www.indeed.com/cmp/BICP/jobs/Data-Scientist-dadca2fb7ae7e099?vjs=3", "Job Description": "BICP a leading edge BI, Analytics and Big Data consulting firm is currently seeking Finance Analytics Consultant to support one of our long standing and direct retail client in downtown San Francisco, CA. This engagement will be focused on strategic pricing and promotions initiatives at one of the most recognizable brands in the apparel industry. Ideal consultants will have and Econometrics background and deeply analytical mindset. Must have prior experience with time series forecasting models: ETS, ARIMA, Holt-Winters, etc. and Bayesian techniques like Bayesian Structural Time Series or state-space models. Consultant will be expected to (1) Research and document historical trends of past pricing strategies (2) Provide promotion forecasts to planning and sales (3) Perform portfolio optimization, inventory optimization or pricing optimization (4) Develop price elasticity curves and create granular PE curves based on region/product line. We’re looking to hire candidates that can thrive in an Agile environment and who possesses great interpersonal and communication skills to work effectively with parallel teams and have the ability to closely collaborate & drive conversations with the business.If you’re looking to join an organization where there is tremendous growth opportunity, that operates with transparency and fosters a highly collaborative approach then BICP could be a great place for you. We offer excellent compensation and the flexibility you will not find at other consulting firms. We offer a guaranteed bonus, relocation (if required) and after 12 months our consultants have the option to join our end client as a full time employee without liability. With BICP you have the freedom and flexibility to do what’s best for your career without limitations.Please Note: U.S. Citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor H1-b visas at this time.Job Types: Full-time, ContractSalary: $120,000.00 to $170,000.00 /yearExperience:Data Science: 1 yearEducation:Bachelor'sRequired work authorization:United States"}, {"Job Title": "Data Scientist", "Company Name": "Groupon", "Location": "San Francisco, CA 94115", "Url": "https://www.indeed.com/viewjob?jk=b25e5c1bfee33a6c&from=serp&vjs=3", "Job Description": "At Groupon, data drives our decisions. We are looking for a Data Scientist who will join an influential team to guide the Groupon Goods product roadmap by deriving meaningful insights from the wealth of data we have from our customers, logistics networks and suppliers. You will be building machine learning models which empowers pricing intelligence and supply intelligence initiatives. We need an analytics and modeling expert the team can count and you will get to see your work rapidly feed back into the evolution of our products.\nThe ideal candidate will:\nSynthesize raw data into recommendations on how products should evolve\nBuild machine learning algorithms to enable decision making in order to optimize customer experience/reduce cost/maximize profits or customer value\nWork with product management and engineering and operations teams to develop KPIs for new features and instrumentation to quantify the adoption of new product initiatives\nQuantify the value of existing product improvements or the potential value of new product hypotheses.\nDesign and support large-scale multivariate tests to prove out new ideas\nCreate product scorecards for teams and managers to track product performance, business impact and discover opportunities\nDeep-dive analyses to identify root causes of product or operational issues\nDesign both the business logic and the technical specifications to extract key data elements from a data warehouse\nQualifications:\nBS or graduate degree in Computer Science, Statistics, Mathematics, Economics or similar quantitative field, with an emphasis on predictive analytics, data mining, statistics, machine learning, algorithms, etc.\n3-6 years of data science experience working closely with product and engineering\nAbility to translate business objectives and problems into analytical problems, and use quantitative/qualitative skills to deliver simple, logical and actionable solutions.\nExperience with data visualization (such as Tableau) and presentation\nAdvanced proficiency in R, Python, and Excel\nProficiency with SQL, Hadoop, or other Map/Reduce (or other scripting language)\nProven ability to own data science initiatives end-to-end\nAbility to build predictive modeling such as time series, k-nearest neighbors, random forests, ensemble methods\nUnderstanding of applied math topics, such as probability and statistics, linear algebra, basic optimization techniques, etc.\nAbility to understand and use software engineering techniques - parsing through data logs, leading instrumentation specifications and implementation, using and rewriting APIs, integrating APIs with data tools, knowledge and integration through machine learning platforms"}, {"Job Title": "Data Scientist", "Company Name": "Massdrop", "Location": "San Francisco, CA", "Url": "https://www.indeed.com/viewjob?jk=9fa7ffd8f4f789e1&from=serp&vjs=3", "Job Description": "Overview\n\nWe’re looking for a Data Scientist to work directly with the CTO to found Data Science as a discipline at Massdrop. The core responsibilities are to apply quantitative analysis, modeling, and data mining to augment the delivery of content and products. Massdrop is a nexus of social community and e-commerce; there are many signals to leverage for driving unique and engaging experiences for our users. You’ll be working on organizing and delivering community content into a feed that users delight at engaging with on a daily basis.\n\nIn partnership with multinational enthusiast brands, you’ll also be working on translating signals from our knowledgeable, active user base into best-in-class physical products that are loved by the community. You’ll be adding to, and accelerating the growth of, our list of collaboration products (such as the https://www.massdrop.com/buy/massdrop-sennheiser-hd6xx ( https://www.massdrop.com/buy/massdrop-sennheiser-hd6xx ), with $10M+ in sales) developed for and by our community.\n\nHere's what you'll do as part of the team:\n\nPerform deep dive analysis to understand and optimize the key levers of our ads and search ecosystems\nDesign core metrics for team efforts and model trade offs across product areas\nApply statistics, modeling, and ML to improve the efficiency of systems and relevance algorithms\nWork with product managers and engineers to design data products and debug A/B experiments\n\nAnd here are the skills and experience you'll need to be successful:\n\n\n2+ years of work experience applying scientific methods to solve-real-world problems on web scale data\nExpertise in at least one scripting language, preferably Python\nKnowledgeable about the machine learning trade-offs and model evaluation\n\nWho We Are\n\nMassdrop puts community first. We create high-quality, custom gear, apparel, and products inspired and designed by our online communities. We provide over 5 million members a place to connect, discuss, buy products together, and learn about the things that are important to them.\n\nThe engineering team contains of a number of seasoned developers who have scaled web apps beyond 10M daily active users. We have seen a lot of what doesn’t work in our past engineering teams and distilled the right practices and processes to ensure a healthy, sane, and efficient work environment. We’re all about quality engineering, not big egos; the best ideas win here.\n\nIf this sounds like the right environment for you to continue your software engineering career, then please submit an application. We’d love to talk with you!"}, {"Job Title": "Data Scientist", "Company Name": "YouLand", "Location": "San Francisco, CA", "Url": "https://www.indeed.com/cmp/stealth-mode/jobs/Data-Scientist-c0de17b33626a1d4?vjs=3", "Job Description": "YouLand is a fintech company that focuses on US real estate assets. Constructing fully automated risk control engine with data analysis, machine learning, and blockchain, we are building a 100% standardized online loan application and approval service platform, providing loan service to all users in the US and overseas. We aim to provide the best user experience with the fastest approval speed within a couple of simple steps.In the Data Scientist, Search role you will help Youland build the most important background models. You will acquire data about real estate properties from the Internet to build borrower credit analysis model, property valuation model, and risk pricing model to help us provide the best service to our users. Working with Product Management and Engineering, you'll guide A/B test design design complex models to drive an understand of traffic and our site users, analyze results, automate manual processes, promote self-service analytics through Tableau, uncover insights, and inform key decisions that directly impact our growth.What We Are Looking ForWe are looking for both summer internship and full time positions. Undergraduate students are welcome to apply to the internship position.Who You AreSuccessful: We're looking for someone with 2-3 years of on-the-job experience driving high impact business value through deriving insights from data as well as a demonstrated ability to play an active role in putting your analytical findings into practice.Sharp: You have exceptional analytical and quantitative skills. A B.S. in mathematics, statistics, economics, computer science, engineering or one of the hard sciences is required. An advanced degree is preferred.Creative: You are able to build and automate sophisticated mathematical models. You love to play with massive data sets from various sources to uncover surprising truths and opportunities. Your analyses and models will be used to make major decisions about the direction of our core technology.Practical: Translate ideas and theory into data informed solutions the business can use to grow - we are looking for someone with a practical approach to digging in and doing what needs to be done to get the job done.Curious: YouLand is looking for an analytical juggernaut that doesn't stop at answering the \"what\" questions. We want someone who hungers for the \"why\" and \"what if\" questionsConcise: Communicating your ideas clearly to folks who don't share your passion for analytics is the mark of mastery.Flexible: You are comfortable with a fast past, quick turnaround work environment.Desired Skills & ExperienceTechnical chops: Python, SQL, Tableau, Spark, H base, Kafka, Statistical and mathematical modeling are required. Knowledge about regression and random forest machine learning models are also required.Education: A B.S. in mathematics, statistics, economics, computer science, engineering or one of the hard sciences is required. An advanced degree is preferred.For internship position, candidate should be pursuing a Bachelor or graduate degree from an accredited college/universityJob Types: Full-time, InternshipEducation:Bachelor's"}, {"Job Title": "Data Scientist", "Company Name": "Newton Group ESA", "Location": "San Francisco, CA", "Url": "https://www.indeed.com/cmp/Newton-Group-ESA/jobs/Data-Scientist-bf26e674e0fc05b6?sjdu=QwrRXKrqZ3CNX5W-O9jEveJgZ7DRbh_ySwPONsqRa9YeCgrqsl72YaYgBRrHFthaXuG3oyG5dF9XbdMizMLPxA&vjs=3", "Job Description": "We are looking for a hands-on, results-oriented, intellectually curious, self-learning Data Scientist to join our team. Using a variety of modeling and algorithmic methods, this individual will have familiarity with product analytics, marketing analytics, web analytics, business analytics, and customer value. Our management team is excited to provide this opportunity to someone who can drive positive change that will impact every person within the organization. We are The Newton Group and want you to be a part of our elite team!We are an experienced group of professionals who help timeshare owners terminate their ownership and all associated financial responsibilities. We are focused on being THE #1 trusted name in our industry. Our company has been in business for over fifteen years and has an A+ rating with the Better Business Bureau which we are proud to hold.We are looking for a highly educated, experienced and data driven individual to join our team. This position will be remote.Experience:At least 10 years in the software industry as software engineer or data scientistAt least 5 years Data Science experienceMachine Learning/AI: familiar with many supervised model types including Generalized Linear Models, Random Forests, Gradient Boosting Machines, Support Vector Machines, Deep Learning Neural Nets, Ensemble Learning/Stacking. Unsupervised model types like Principal Component Analysis, K-means clustering, Hierarchical Clustering, Autoenconders.Building models for highly imbalanced data sets. Bias/Variance tradeoff. Model quality metrics like Rsquared, AUC. Outlier detection and removal.Advanced Statistics/Math: ANOVA/ANCOVA. Bootstrapping, confidence intervals. Causal modeling in both experimental and observational data sets. Bayesian networks. Bayesian regression. Markov Chain Monte Carlo, Gibbs sampling. Gaussian processes. Variational Inference.Programming: Python (and good familiarity with scikit-learn, numpy, scipy, matplotlib libraries), R for modeling and general purpose languages such C/C++, Java or C#, SQLTechnologies:Python, R, Hadoop, Spark, H2O, Tensorflow, Amazon Web Services, MySQL databaseQualifications and Skills:This position is remotePossess excellent communication skills and ability to engage with senior leaders to design well-constructed analyses and work cross-functionally with managers to integrate results into the operations.Strong educational background from high caliber learning institutionBachelors and Masters in Computer Science, Math or Engineering (preferred candidates earned 3.5 GPA or greater from reputable university)Self-starter and hard workerDetail and goal orientedAn absolute winning mentalityFast worker who isn’t afraid to ask questions or go the extra mile to ensure proper completionBenefits:Healthcare Benefits offered after 30 days- Medical, Dental, Vision and Life!Personalized, Individual Career Map- Each employee has a career map made for advancement opportunities within the companyPaid TrainingPTO after 90 daysSick & Vacation time after 1 yearPaid holidaysAll employees receive a 90-day performance review & yearly performance reviewsGenerous referral bonusesAdvancement and professional development opportunitiesCasual work environment and dressNew office with a fully stocked break roomHours: 7:30am - 4:30pm M-F (Flex time)Pay: DOEIf you are looking to take leadership of your future and work in a fun, reputable and growing company, please send your resume over today! We look forward to working with you!Job Type: Full-timeExperience:Data Science: 5 yearsEducation:Bachelor's"}, {"Job Title": "Data Scientist", "Company Name": "Transdev", "Location": "South San Francisco, CA 94080", "Url": "https://www.indeed.com/viewjob?jk=e10f7094a543e89c&tk=1cenko0p81flo0un&from=serp&alid=3&advn=7090944648798151", "Job Description": "**Overview**\n\nThe Data Scientist will be a part of Compass Transportation, a subsidiary of Transdev. Compass Transportation has become one of the largest B2B transportation providers in the Bay Area over the past ten years. We specialize in providing commuter services across the Bay Area as well as exploring new shared ride products. As a transportation operator we have been gifted with heaps of data that we are looking to better utilize in driving improvements, efficiencies, and ultimately feeding into our strategy.\n\nDo you have a deep quantitative background? Do you believe data builds better products and has a key role in engineering decisions? Are you able to translate data into strategy? If so, this is the job for you!\n\nOur Data Scientist sits at the intersection of strategic planning and technology development. Whether it’s collaborating with product leadership to help create, implement, or evaluate success metrics or working with our developers to provide intuition on how to improve our products.\n\n**Responsibilities**\n\n+ Strategic planning based on data analytics\n\n+ Collaborating with various department to evaluate product performance\n\n+ Finding solutions on improvements of our products\n\n**Qualifications**\n\n**Education, License, Certifications: **\n\n+ Bachelor's degree required, preferably in Statistics, Finance or related field\n\n+ Master's degree preferred\n\n**Skills and Knowledge Required: **\n\n+ Experience with Excel\n\n+ SQL, R, and Python experience preferred but not required\n\n+ Strategic mindset - you're comfortable thinking a few steps ahead of where the team is at now\n\n+ Driven and focused self-starter, great communicator with amazing follow-through. You are someone who will aggressively tackle their work and love the responsibility of being individually empowered.\n\n+ A preference quality over quantity- you are driven to get the math right and aspire to build the right solution; and also are someone who enjoys a team that holds each other to a high bar.\n\n_The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified._\n\n_Transdev is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Applicants will receive fair and impartial consideration without regard to race, sex, color, national origin, age, disability, veteran status, genetic data, gender identity, sexual orientation, religion or other legally protected status, or any other classification protected by federal, state, or local law._\n\n_EEO is the Law Poster: http://www1.eeoc.gov/employers/poster.cfm_\n\n_Drug free workplace_\n\n_If based in the United States, applicants must be eligible to work in US without restrictions for any employer at any time; be able to pass a drug screen and background check_\n\n**Requisition ID** _2018-8273_\n\n**Position Category** _Information Technology (IT)_\n\n**Internal Code** _\\#TOD_\n\n**Internal Reference** _IT_\n\n**Internal Code 3** _Ind1_\n\n**Company/Division** _Compass Transportation_"}]